theatrus/ksdk/platform/devices/MKV45F15/include/MKV45F15_features.h
/* @brief Has OSC1 external oscillator. */
#define FSL_FEATURE_OSC_HAS_OSC1 (0)
/* @brief Has OSC0 external oscillator. */
#define FSL_FEATURE_OSC_HAS_OSC0 (0)
/* @brief Has OSC external oscillator (without index). */
#define FSL_FEATURE_OSC_HAS_OSC (0)
/* @brief Number of OSC external oscillators. */
#define FSL_FEATURE_OSC_OSC_COUNT (0)
/* @brief Has external reference clock divider (register bit field DIV[ERPS]). */
#define FSL_FEATURE_OSC_HAS_EXT_REF_CLOCK_DIVIDER (1)

/* PDB module features */

/* @brief Define the count of supporting ADC pre-trigger for each channel. */
#define FSL_FEATURE_PDB_ADC_PRE_CHANNEL_COUNT (4)
/* @brief Has DAC support. */
#define FSL_FEATURE_PDB_HAS_DAC (1)

/* PIT module features */

/* @brief Number of channels (related to number of registers LDVALn, CVALn, TCTRLn, TFLGn). */
#define FSL_FEATURE_PIT_TIMER_COUNT (4)
/* @brief Has lifetime timer (related to existence of registers LTMR64L and LTMR64H). */
#define FSL_FEATURE_PIT_HAS_LIFETIME_TIMER (0)
/* @brief Has chain mode (related to existence of register bit field TCTRLn[CHN]). */
#define FSL_FEATURE_PIT_HAS_CHAIN_MODE (1)
/* @brief Has shared interrupt handler (has not individual interrupt handler for each channel). */
#define FSL_FEATURE_PIT_HAS_SHARED_IRQ_HANDLER (0)

/* PMC module features */

/* @brief Has Bandgap Enable In VLPx Operation support. */
#define FSL_FEATURE_PMC_HAS_BGEN (1)
/* @brief Has Bandgap Buffer Drive Select. */
#define FSL_FEATURE_PMC_HAS_BGBDS (1)

/* PORT module features */

/* @brief Has control lock (register bit PCR[LK]). */
#define FSL_FEATURE_PORT_HAS_PIN_CONTROL_LOCK (1)
/* @brief Has open drain control (register bit PCR[ODE]). */
#define FSL_FEATURE_PORT_HAS_OPEN_DRAIN (1)
/* @brief Has digital filter (registers DFER, DFCR and DFWR). */
#define FSL_FEATURE_PORT_HAS_DIGITAL_FILTER (1)
/* @brief Has DMA request (register bit field PCR[IRQC] values). */
#define FSL_FEATURE_PORT_HAS_DMA_REQUEST (1)
/* @brief Has pull resistor selection available. */
#define FSL_FEATURE_PORT_HAS_PULL_SELECTION (1)
/* @brief Has pull resistor enable (register bit PCR[PE]). */
#define FSL_FEATURE_PORT_HAS_PULL_ENABLE (1)
/* @brief Has slew rate control (register bit PCR[SRE]). */
#define FSL_FEATURE_PORT_HAS_SLEW_RATE (1)
/* @brief Has passive filter (register bit field PCR[PFE]). */
#define FSL_FEATURE_PORT_HAS_PASSIVE_FILTER (1)
/* @brief Has drive strength control (register bit PCR[DSE]). */
#define FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH (1)
/* @brief Has separate drive strength register (HDRVE). */
#define FSL_FEATURE_PORT_HAS_DRIVE_STRENGTH_REGISTER (0)
/* @brief Has glitch filter (register IOFLT). */
#define FSL_FEATURE_PORT_HAS_GLITCH_FILTER (0)

/* PWM module features */

#if defined(CPU_MKV45F128VLH15) || defined(CPU_MKV45F256VLH15)
    /* @brief Number of each EflexPWM module channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNEL_COUNT (8U)
    /* @brief Number of EflexPWM module A channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELA_COUNT (4U)
    /* @brief Number of EflexPWM module B channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELB_COUNT (4U)
    /* @brief Number of EflexPWM module X channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELX_COUNT (0U)
    /* @brief Number of each EflexPWM module compare channels interrupts. */
    #define FSL_FEATURE_PWM_CMP_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module reload channels interrupts. */
    #define FSL_FEATURE_PWM_RELOAD_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module capture channels interrupts. */
    #define FSL_FEATURE_PWM_CAP_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module reload error channels interrupts. */
    #define FSL_FEATURE_PWM_RERR_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module fault channels interrupts. */
    #define FSL_FEATURE_PWM_FAULT_INT_HANDLER_COUNT (1U)
    /* @brief Number of submodules in each EflexPWM module. */
    #define FSL_FEATURE_PWM_SUBMODULE_COUNT (4U)
#elif defined(CPU_MKV45F128VLL15) || defined(CPU_MKV45F256VLL15)
    /* @brief Number of each EflexPWM module channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNEL_COUNT (12U)
    /* @brief Number of EflexPWM module A channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELA_COUNT (4U)
    /* @brief Number of EflexPWM module B channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELB_COUNT (4U)
    /* @brief Number of EflexPWM module X channels (outputs). */
    #define FSL_FEATURE_PWM_CHANNELX_COUNT (4U)
    /* @brief Number of each EflexPWM module compare channels interrupts. */
    #define FSL_FEATURE_PWM_CMP_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module reload channels interrupts. */
    #define FSL_FEATURE_PWM_RELOAD_INT_HANDLER_COUNT (4U)
    /* @brief Number of each EflexPWM module capture channels interrupts. */
    #define FSL_FEATURE_PWM_CAP_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module reload error channels interrupts. */
    #define FSL_FEATURE_PWM_RERR_INT_HANDLER_COUNT (1U)
    /* @brief Number of each EflexPWM module fault channels interrupts. */
    #define FSL_FEATURE_PWM_FAULT_INT_HANDLER_COUNT (1U)
    /* @brief Number of submodules in each EflexPWM module. */
    #define FSL_FEATURE_PWM_SUBMODULE_COUNT (4U)
#endif

/* RCM module features */

/* @brief Has Loss-of-Lock Reset support. */
#define FSL_FEATURE_RCM_HAS_LOL (1)
/* @brief Has Loss-of-Clock Reset support. */
#define FSL_FEATURE_RCM_HAS_LOC (1)
/* @brief Has JTAG generated Reset support. */
#define FSL_FEATURE_RCM_HAS_JTAG (0)
/* @brief Has EzPort generated Reset support. */
#define FSL_FEATURE_RCM_HAS_EZPORT (0)
/* @brief Has bit-field indicating EZP_MS_B pin state during last reset. */
#define FSL_FEATURE_RCM_HAS_EZPMS (0)
/* @brief Has boot ROM configuration, MR[BOOTROM], FM[FORCEROM] */
#define FSL_FEATURE_RCM_HAS_BOOTROM (0)
/* @brief Has sticky system reset status register RCM_SSRS0 and RCM_SSRS1. */
#define FSL_FEATURE_RCM_HAS_SSRS (1)

/* SIM module features */

